package com.designpattern.principle._1_openclose;

/**
 * @author jk
 * @version 1.0.0
 * @create 2020/7/23 17:13
 */
public class Concept {

    /**
     *
     *
     * 1. 开闭原则
     *      * 定义: 一个软件实体如类,模块和函数应该对拓展开放,对修改关闭
     *      * 用抽象构建框架,用实现拓展细节
     *      * 优点: 提高软件系统的可复用性及可维护性
     *
     *      开闭原则（Open-Closed Principle，OCP）是指一个软件实体（如类、模块和函数）应该对扩展开放，
     *      对修改关闭,所谓的开闭，也正是对扩展和修改两个行为的一个原则。它强调的是用抽象构建框架，用实现拓展细节，
     *      可以提高软件系统的可复用性及可维护性。开闭原则是面向对象设计中最基础的设计原则。
     *      它指导我们如何建立稳定、灵活的系统。例如版本更新，我们尽可能不修改原代码，但是可以增加新功能。
     *
     */
}
